app/controllers/items_controller.rb

  def index
    if params[:q]



      najdene =Item.where("name LIKE ?", "%#{params[:q]}%" )
      list = parent_items_list(najdene)

      @items = Item.where(:id => list )

    else
      #@products = []
      # puts "prazdne"
      @items = Item.all
---
SELECT "items".* FROM "items"  WHERE (name LIKE 'x')  ORDER BY (case when items.ancestry is null then 0 else 1 end), items.ancestry, created_at
SELECT "items".* FROM "items"  WHERE "items"."id" IN (1, 2)  ORDER BY (case when items.ancestry is null then 0 else 1 end), items.ancestry, created_at
SELECT "items".* FROM "items"   ORDER BY (case when items.ancestry is null then 0 else 1 end), items.ancestry, created_at

  def create
    puts "********************* " + item_params.to_s
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("ancestry", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ancestry", "1"], ["created_at", "2014-05-15 21:23:01.137283"], ["name", "yyy"], ["updated_at", "2014-05-15 21:23:01.137283"]]